tests/fixtures/http_ab_baseline_sample.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        Gene
Server Hostname:        127.0.0.1
Server Port:            8088

Document Path:          /slow
Document Length:        19 bytes

Concurrency Level:      2
Time taken for tests:   1.612 seconds
Complete requests:      8
Failed requests:        0
Total transferred:      1272 bytes
HTML transferred:       152 bytes
Requests per second:    4.96 [#/sec] (mean)
Time per request:       403.000 [ms] (mean)
Time per request:       201.500 [ms] (mean, across all concurrent requests)
Transfer rate:          0.77 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:   200  402  15.0    404     424
Waiting:      200  402  15.0    404     424
Total:        200  402  15.0    404     424

Percentage of the requests served within a certain time (ms)
  50%    404
  66%    407
  75%    411
  80%    418
  90%    424
  95%    424
  98%    424
  99%    424
 100%    424 (longest request)